
LINK_BOT = 'https://t.me/learn_for_shaida_bot'
NEW_USER  = f'⚡Вы использовали ваше бесплатное сообщение: следующее сообщение можно будет отправить через 7 дней. Напишите <a href="{LINK_BOT}">боту</a> для приобретения подписки. \n<b>Тарифы:</b> \n👉подписка на 30 дней - 350 руб\n👉одно сообщение - 50 руб'
S_DAY_LIMIT = '⚡Вы использовали ваше бесплатное сообщение: следующее сообщение можно будет отправить через 7 дней.'
ONE_MSG = '⚡Вы потратили купленные сообщения'


BUY_30 = '30 дней🕚'
BUY_30_CALL = 'buy_30'
BUY_1 = 'одно сообщение🗣'
BUY_1_CALL = 'buy_1'
STATUS = 'статус🔷'
ADMIN_CHAT = 'поддержка🆘'
ADMIN_CHAT_URL = 'https://t.me/Kev1nBeik0n'
SHOW_STATUS = 'show_status'
CHAT_LINK = 'https://t.me/test_shaid'
MSG = f'Приобретай <b>подписку</b> или купи <b>одно сообщение</b>, чтобы писать в нашем <a href="{CHAT_LINK}">чате</a>.\n'
START_BOT = f'<a href="{LINK_BOT}">Пиши ему</a>, чтобы приобрести права🔐.'
WELCOME = f'Привет😺, {{}}. Приобретай <b>подписку</b> или купи <b>одно сообщение</b>, чтобы писать в нашем <a href="{CHAT_LINK}">чате</a>.'

BILL_COMMENT = 'оплата: {}\n' \
               'id пользователя: {}' \

ERROR = f'⚡Ошибка, обратитесь в <a href="{ADMIN_CHAT_URL}">поддержку</a>🆘'
BILL_MESSAGE = '<b>Перейди по ссылке, чтобы оплатить💸 (❗жми потвердить только после оплаты❗):</b>\n' \
               '{}'

CHECK = 'подтвердить💸'

SUCCESS_BILL = 'Оплата прошла успешно✅'
NONE_BILL = 'Оплаты не было🚫'


STATUS_TEXT = """
{}🙍
🕚Подписка: <b>{}</b>
Одно cообщение☝ (раз в 7 дней): <b>{}</b>
Количество купленных сообщений: <b>{}</b>
"""

GIVE30 = 'дать подписку 30'
TAKE30 = 'отменить подписку 30 дней'


GIVE1 = 'дать одно сообщение'
TAKE1 = 'забрать одно сообщение'

GIVE7 = 'обновить дату разового сообщения'

SHOW_USER = 'статус юзера'